plan.org
* WHIZ Token as per ERC20 ( Or its Derivatives ) Standard. 
** Currently Planned Timeline 
*** Feb 
****  Making a Repo. 
****  Start working on Synopsis - Vaibav, Rishab
****  Implementing beta version of token with ERC20 Standard - Sanad, Krishna.
****  Research and Wishful Documentation - Sanad
****  Setup Solidity Development Environment on each node so as to ease workflow.
****  Moreover continue reading other smart contracts and related information.


* Specification ( make clear from Abhiroop Sir )

* Parts of Token
**  Contract - ERC20 written from scratch additional functionality based on use case.
**  Wallet - Intention is to make a minimalistic clone [[http://github.com/MyEtherWallet/etherwallet][MyEtherWallet]] preferably as a browser extension.
**  Test Network - This is required for presentation/demo of workings of token.
