plan.md

# Table of Contents

1.  [WHIZ Token as per ERC20 ( Or its Derivatives ) Standard.](#org95866ac)
    1.  [Currently Planned Timeline](#orge47a23f)
        1.  [Feb](#org9d751bb)
2.  [Specification ( make clear from Abhiroop Sir )](#org62c4f3e)
3.  [Parts of Token](#org0aac194)
    1.  [Contract - ERC20 written from scratch additional functionality based on use case.](#org38a095c)
    2.  [Wallet - Intention is to make a minimalistic clone MyEtherWallet preferably as a browser extension.](#orgcd655a7)
    3.  [Test Network - This is required for presentation/demo of workings of token.](#orgf5a132e)


<a id="org95866ac"></a>

# WHIZ Token as per ERC20 ( Or its Derivatives ) Standard.


<a id="orge47a23f"></a>

## Currently Planned Timeline


<a id="org9d751bb"></a>

### Feb

1.  Making a Repo.

2.  Start working on Synopsis - Vaibav, Rishab

3.  Implementing beta version of token with ERC20 Standard - Sanad, Krishna.

4.  Research and Wishful Documentation - Sanad

5.  Setup Solidity Development Environment on each node so as to ease workflow.

6.  Moreover continue reading other smart contracts and related information.


<a id="org62c4f3e"></a>

# Specification ( make clear from Abhiroop Sir )


<a id="org0aac194"></a>

# Parts of Token


<a id="org38a095c"></a>

## Contract - ERC20 written from scratch additional functionality based on use case.


<a id="orgcd655a7"></a>

## Wallet - Intention is to make a minimalistic clone [MyEtherWallet](http://github.com/MyEtherWallet/etherwallet) preferably as a browser extension.


<a id="orgf5a132e"></a>

## Test Network - This is required for presentation/demo of workings of token.

